ExerciseDB Structure

[
  {
    "bodyPart": "upper legs",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/TlETElKG-cme2H",
    "id": "0024",
    "name": "barbell bench front squat",
    "target": "quads",
    "secondaryMuscles": [
      "hamstrings",
      "glutes",
      "calves"
    ],
    "instructions": [
      "Start by standing with your feet shoulder-width apart and the barbell resting on your upper chest, just below your collarbone.",
      "Hold the barbell with an overhand grip, keeping your elbows up and your upper arms parallel to the ground.",
      "Lower your body down into a squat position by bending at the knees and hips, keeping your back straight and your chest up.",
      "Pause for a moment at the bottom of the squat, then push through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell bench front squat is a compound lower body exercise that targets the quadriceps, with secondary emphasis on the hamstrings, glutes, and calves. It requires holding a barbell in the front rack position and performing a squat, demanding good core stability, balance, and mobility.",
    "difficulty": "intermediate",
    "category": "strength"
  },
  {
    "bodyPart": "chest",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/8DybE1ln2WAE-s",
    "id": "0025",
    "name": "barbell bench press",
    "target": "pectorals",
    "secondaryMuscles": [
      "triceps",
      "shoulders"
    ],
    "instructions": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with an overhand grip slightly wider than shoulder-width apart.",
      "Lift the barbell off the rack and hold it directly above your chest with your arms fully extended.",
      "Lower the barbell slowly towards your chest, keeping your elbows tucked in.",
      "Pause for a moment when the barbell touches your chest.",
      "Push the barbell back up to the starting position by extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell bench press is a classic compound exercise that primarily targets the pectoral muscles, while also engaging the triceps and shoulders. It is performed by lying on a bench and pressing a barbell up and down in a controlled manner.",
    "difficulty": "intermediate",
    "category": "strength"
  },
  {
    "bodyPart": "upper legs",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/D2lfEXMy1FEw2i",
    "id": "0026",
    "name": "barbell bench squat",
    "target": "quads",
    "secondaryMuscles": [
      "glutes",
      "hamstrings",
      "calves"
    ],
    "instructions": [
      "Set up a barbell on a squat rack at chest height.",
      "Stand facing away from the rack, with your feet shoulder-width apart.",
      "Bend your knees and lower your body down into a squat position, keeping your back straight and chest up.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Lift the barbell off the rack and step back, ensuring your feet are still shoulder-width apart.",
      "Lower your body down into a squat, keeping your knees in line with your toes.",
      "Pause for a moment at the bottom, then push through your heels to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell bench squat is a compound lower body exercise that primarily targets the quadriceps, while also engaging the glutes, hamstrings, and calves. It involves squatting with a barbell, requiring good technique and strength.",
    "difficulty": "intermediate",
    "category": "strength"
  },
  {
    "bodyPart": "upper arms",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/u0JXM6Tk9gzTPV",
    "id": "0030",
    "name": "barbell close-grip bench press",
    "target": "triceps",
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with a close grip, slightly narrower than shoulder-width apart.",
      "Unrack the barbell and lower it slowly towards your chest, keeping your elbows close to your body.",
      "Pause for a moment when the barbell touches your chest.",
      "Push the barbell back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell close-grip bench press is a compound exercise primarily targeting the triceps, with secondary emphasis on the chest and shoulders. It is performed by lying on a bench, gripping the barbell with a close grip, and pressing the weight up and down while keeping the elbows close to the body.",
    "difficulty": "intermediate",
    "category": "strength"
  },
  {
    "bodyPart": "chest",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/U7wRS2YQ2Cw28Z",
    "id": "0033",
    "name": "barbell decline bench press",
    "target": "pectorals",
    "secondaryMuscles": [
      "triceps",
      "shoulders"
    ],
    "instructions": [
      "Lie on a decline bench with your feet secured and your head lower than your hips.",
      "Grasp the barbell with an overhand grip slightly wider than shoulder-width apart.",
      "Unrack the barbell and lower it slowly towards your chest, keeping your elbows tucked in.",
      "Pause for a moment at the bottom, then push the barbell back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell decline bench press is a compound exercise targeting the lower portion of the pectoral muscles. It is performed on a decline bench, requiring the lifter to press a barbell upward from a declined position, engaging the chest, triceps, and shoulders.",
    "difficulty": "intermediate",
    "category": "strength"
  },
  {
    "bodyPart": "chest",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/MwahfEDNEkdBUr",
    "id": "0045",
    "name": "barbell guillotine bench press",
    "target": "pectorals",
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Lower the barbell slowly towards your neck, keeping your elbows pointed outwards.",
      "Pause for a moment when the barbell is just above your neck.",
      "Push the barbell back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell guillotine bench press is a variation of the bench press where the bar is lowered to the neck instead of the chest, placing greater emphasis on the upper pectorals. This exercise requires careful control and proper technique to avoid injury.",
    "difficulty": "advanced",
    "category": "strength"
  },
  {
    "bodyPart": "chest",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/ymk7PvhHVdQpbj",
    "id": "0047",
    "name": "barbell incline bench press",
    "target": "pectorals",
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Set up an incline bench at a 45-degree angle.",
      "Lie down on the bench with your feet flat on the ground.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Unrack the barbell and lower it slowly towards your chest, keeping your elbows at a 45-degree angle.",
      "Pause for a moment at the bottom, then push the barbell back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell incline bench press is a compound upper-body exercise that targets the upper portion of the pectoral muscles, with secondary emphasis on the shoulders and triceps. It is performed on an incline bench using a barbell, making it a staple in strength training routines for developing chest size and strength.",
    "difficulty": "intermediate",
    "category": "strength"
  },
  {
    "bodyPart": "upper arms",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/rwT4978QQelHw3",
    "id": "0052",
    "name": "barbell jm bench press",
    "target": "triceps",
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Lower the barbell to your chest, keeping your elbows tucked in close to your body.",
      "Push the barbell back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell JM bench press is a triceps-focused pressing movement that combines elements of a close-grip bench press and a triceps extension. It is performed lying on a bench, lowering the barbell to the chest with elbows tucked, and pressing back up.",
    "difficulty": "advanced",
    "category": "strength"
  },
  {
    "bodyPart": "waist",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/70yLEZWUVvMX43",
    "id": "0083",
    "name": "barbell rollerout from bench",
    "target": "abs",
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Start by kneeling on the floor with a barbell placed on a bench in front of you.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Keeping your core engaged and your back straight, slowly roll the barbell forward, extending your arms in front of you.",
      "Continue rolling the barbell forward until your body is fully extended and your arms are overhead.",
      "Pause for a moment at the fully extended position, then slowly roll the barbell back towards your body, returning to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell rollout from bench is an advanced core exercise that targets the abdominal muscles, with secondary emphasis on the shoulders and triceps. It requires significant core strength, stability, and control to perform safely and effectively.",
    "difficulty": "advanced",
    "category": "strength"
  },
  {
    "bodyPart": "chest",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/zi5amoioXg3ScE",
    "id": "0122",
    "name": "barbell wide bench press",
    "target": "pectorals",
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with a wide grip, slightly wider than shoulder-width apart.",
      "Lift the barbell off the rack and hold it directly above your chest with your arms fully extended.",
      "Lower the barbell slowly towards your chest, keeping your elbows slightly flared out.",
      "Pause for a moment when the barbell touches your chest, then push it back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The barbell wide bench press is a compound strength exercise targeting the pectoral muscles, with secondary emphasis on the shoulders and triceps. It requires a barbell and a bench, and involves lowering the barbell to the chest with a wide grip before pressing it back up.",
    "difficulty": "intermediate",
    "category": "strength"
  }
]